{
  "courses": 13,
  "chair": "Terri Ramos",
  "name": "Communications",
  "allcourses": [
    {
      "credits": 1,
      "name": "MASS MEDIA : VISUAL JOURNALISM I (1084)",
      "weight": "regular",
      "description": "Note 40, Core 40 with Academic Honors and Core 40 with Technical Honors diploma Students enrolled in this course will have the opportunity to explore the field of journalism from a visual perspective. Students will shoot photos, design graphics packages and pages, explore color theory and design techniques, and learn about the impact of visuals on all forms of media coverage. Further, they will utilize programs like Bridge, Photoshop, InDesign and Illustrator. Students will look at and practice the visual modes of news coverage as they range from print to web media, including the laws and ethics behind media coverage decisions. Students are encouraged to have their own digital cameras, but school-provided cameras will be available for use with a parent-signed equipment liability waiver. This course serves as a prerequisite for both the Pinnacle yearbook staff and the HiLite newsmagazine staff. ",
      "id": 0,
      "semesters": 1,
      "classification": "Regular"
    },
    {
      "credits": 1,
      "name": "MASS MEDIA : VISUAL JOURNALISM II (1084)",
      "weight": "regular",
      "description": "Note 40, Core 40 with Academic Honors and Core 40 with Technical Honors diploma As a continuation to the Visual Journalism 1 course, students enrolled in this class will have the opportunity to further expand their practice and understanding of the visual aspects of journalism, including photography, design, typography, color theory, etc. Students will continue to master their photojournalism and design skills, which will culminate in the form of a personal web-based portfolio of their own work and analyses of professional work. Students will utilize programs like Bridge, Photoshop, InDesign and Illustrator. Students will look at and practice the visual modes of news coverage as they range from print to web media, including the laws and ethics behind media coverage decisions. Students are encouraged to have their own digital cameras, but school-provided cameras will be available for use with a parent-signed equipment liability waiver. This course serves as a prerequisite for both the Pinnacle yearbook staff and the HiLite newsmagazine staff. ",
      "id": 0,
      "semesters": 1,
      "classification": "Regular"
    },
    {
      "credits": 2,
      "name": "STUDENT MEDIA : BEGINNING NEWSPAPER 1-2 (1086)",
      "weight": "regular",
      "description": "Note Students enrolled in this prerequisite class learn everything they need to know to make the successful transition to the HiLite newsmagazine staff (Student Media /Newspaper/HiLite staff). From writing inverted pyramid stories to longer narrative articles and opinion pieces to evaluating and planning for great photography to understanding and working with amazing designs, students in Newspaper 1-2 will understand and practice all of the elements necessary to succeed on the HiLite newspaper staff. Even if students choose not to pursue an opportunity to be on the HiLite staff, the Newspaper 1-2 class still offers a tremendous learning opportunity. In addition to becoming critical readers of media, students in Newspaper 1-2 learn “transferable skills” that will help them in any situation. On a regular basis, Newspaper 1-2 students practice meeting deadlines, interviewing sources, writing for an audience and working on cooperative projects. In very few other high school classes will students hone those techniques. Fee ",
      "id": 0,
      "semesters": 2,
      "classification": "Regular"
    },
    {
      "credits": 2,
      "name": "STUDENT MEDIA: INTERMEDIATE NEWSPAPER : HILITE STAFF : 3-4 (1086)",
      "weight": "regular",
      "description": "approval; application required (subsequent years on staff). This course may also count for Fine Arts credit as a Directed Elective for the Core 40 Indiana Academic Honors and Core 40 with Technical Honors diplomas for grades 11-12 (Newspaper 5-6/7-8).  Students enrolled in Student Media/Newspaper/HiLite staff work to produce the award- winning HiLite newsmagazine as well as the topically-based Acumen newsmagazine and news website, HiLite Online. Students serve as editors, reporters, photographers, graphic designers and advertisers. This course can be repeated for credit for every semester of a student’s high school career. Before enrolling, students must successfully complete one of the HiLite’s prerequisite courses -- Newspaper 1-2 and/or Visual Journalism I and/or II – and then fill out an application during the spring for approval for the following school year. This course, comparable to an honors course in other departments, requires dedication and commitment, but, as students will attest, the hard work pays off. ",
      "id": 0,
      "semesters": 2,
      "classification": "Regular"
    },
    {
      "credits": 2,
      "name": "STUDENT MEDIA: ADVANCED NEWSPAPER : HILITE STAFF : 5-6, 7-8 (1086)",
      "weight": "regular",
      "description": "approval; application required (subsequent years on staff). This course may also count for Fine Arts credit as a Directed Elective for the Core 40 Indiana Academic Honors and Core 40 with Technical Honors diplomas for grades 11-12 (Newspaper 5-6/7-8).  Students enrolled in Student Media/Newspaper/HiLite staff work to produce the award- winning HiLite newsmagazine as well as the topically-based Acumen newsmagazine and news website, HiLite Online. Students serve as editors, reporters, photographers, graphic designers and advertisers. This course can be repeated for credit for every semester of a student’s high school career. Before enrolling, students must successfully complete one of the HiLite’s prerequisite courses -- Newspaper 1-2 and/or Visual Journalism I and/or II – and then fill out an application during the spring for approval for the following school year. This course, comparable to an honors course in other departments, requires dedication and commitment, but, as students will attest, the hard work pays off. ",
      "id": 0,
      "semesters": 2,
      "classification": "Regular"
    },
    {
      "credits": 2,
      "name": "STUDENT MEDIA: BEGINNING YEARBOOK : 1-2 (1086)",
      "weight": "regular",
      "description": "Note 40, Core 40 with Academic Honors and Core 40 with Technical Honors diploma Students enrolled in the prerequisite Yearbook 1-2 class will learn the foundational information and skill-set necessary for a successful transition onto the Pinnacle yearbook staff (Student Media/Yearbook/Pinnacle Staff). Emphasis will be on in-depth feature and news reporting, media law, and visual storytelling, including photography, design, typography and graphic representation of facts. Students in Yearbook 1-2 will understand and practice all of the elements necessary to succeed on the Pinnacle yearbook staff. Following completion of this course, there is an application process for admission to Pinnacle yearbook staff. For students who do not choose to pursue staff involvement, this remains a valuable elective that provides for media literacy education and a foundation in many transferable skills, such as interpersonal communication, writing and editing, self-motivation and the ability to meet deadlines, that will be valuable elsewhere. This course is recommended for anyone with an interest in journalism and/or media production. Fee ",
      "id": 0,
      "semesters": 2,
      "classification": "Regular"
    },
    {
      "credits": 2,
      "name": "STUDENT MEDIA : INTERMEDIATE YEARBOOK : PINNACLE STAFF : 3-4(1086)",
      "weight": "regular",
      "description": "approval; application required (subsequent years on staff) Note diplomas. It also fulfills the Fine Arts requirement for the Core 40 with Academic Honors. Students enrolled in Student Media/Yearbook/Pinnacle Staff serve as reporters, photographers and editors to plan, publish, market and produce the award-winning Pinnacle yearbook. This course provides study and practice in all aspects of the publishing process, and will emphasize the value of journalistic skills such as interviewing, information gathering, writing, editing, taking photos and designing. After-school production time is occasionally required as a part of this class. This course can be repeated for credit every semester of a student’s high school career, pending prior completion of one of the approved prerequisites (Trends in Media or Yearbook 1-2, Visual Journalism I and/or II) and successful completion of an application process in the spring. ",
      "id": 0,
      "semesters": 2,
      "classification": "Regular"
    },
    {
      "credits": 2,
      "name": "STUDENT MEDIA : ADVANCED YEARBOOK : PINNACLE STAFF 5-6 / 7-8 (1086)",
      "weight": "regular",
      "description": "approval; application required (subsequent years on staff) Note diplomas. It also fulfills the Fine Arts requirement for the Core 40 with Academic Honors. Students enrolled in Student Media/Yearbook/Pinnacle Staff serve as reporters, photographers and editors to plan, publish, market and produce the award-winning Pinnacle yearbook. This course provides study and practice in all aspects of the publishing process, and will emphasize the value of journalistic skills such as interviewing, information gathering, writing, editing, taking photos and designing. After-school production time is occasionally required as a part of this class. This course can be repeated for credit every semester of a student’s high school career, pending prior completion of one of the approved prerequisites (Trends in Media or Yearbook 1-2, Visual Journalism I and/or II) and successful completion of an application process in the spring. ",
      "id": 0,
      "semesters": 2,
      "classification": "Regular"
    },
    {
      "credits": 2,
      "name": "STUDENT MEDIA: BEGINNING RADIO: 1 - 2 (1086)",
      "weight": "regular",
      "description": "Note Core 40, Core 40 with Academic Honors and Core 40 with Technical Honors diplomas Radio 1-2 is the prerequisite course for the WHJE radio program. This class is designed to offer students an introduction to radio broadcasting, and also to improve their basic communications skills. The class will focus specifically on making students proficient in speaking, listening, writing, and socializing. These skills are essential in any future career path. Students will work in a broadcast facility that is state-of-the-art and industrystandard. During the first semester students will operate within a traditional classroom environment. Students will become proficient in historical and contemporary broadcasting, FCC law and ethics, First Amendment rights, vocal development, news and commercial writing, audio studio equipment, and digital audio production. During the second semester students will operate within a lab environment. They will rotate through on-air performance, production, news reporting, career development, and listening stations. By the end of the year all students will have produced content that airs on 91.3 FM and whje.com. ",
      "id": 0,
      "semesters": 2,
      "classification": "Regular"
    },
    {
      "credits": 2,
      "name": "STUDENT MEDIA: INTERMEDIATE RADIO: WHJE: 3 - 4 (1086)",
      "weight": "regular",
      "description": "required Note Core 40, Core 40 with Academic Honors and Core 40 with Technical Honors diplomas. Fulfills the Fine Arts requirement for the Core 40 with Academic Honors. WHJE Radio 3-4 is for all second year WHJE Radio program members, and is the prerequisite for Radio WHJE 5-6. Students in this class will assist in the operation and programming of 91.3 FM. WHJE is a student-run, award-winning, non-commercial educational radio station owned by Carmel Clay Schools. Students will be expected to be proficient in their knowledge of FCC rules and regulations. During the school year students will rotate through four specific department assignments program, news, promotions, and public service. Each grading period the students will encounter department specific tasks including, but not limited to on-air announcing, news reporting, production, and interviewing. In addition students will create feature projects each grading period including, but not limited to; music reviews, personal commentaries, news features, radio dramas, and profiles. Students will also have the opportunity to broadcast live sporting events, as well as represent WHJE at a variety of community events. After school hours are required. ",
      "id": 0,
      "semesters": 2,
      "classification": "Regular"
    },
    {
      "credits": 4,
      "name": "STUDENT MEDIA: ADVANCED RADIO: WHJE: 5 - 6 / 7 - 8 (1086)",
      "weight": "full",
      "description": "application required Note Core 40, Core 40 with Academic Honors and Core 40 with Technical Honors diplomas. Fulfills the Fine Arts requirement for the Core 40 with Academic Honors. WHJE Radio 5-6 / 7-8 is for all or third or fourth year WHJE radio program members. This class carries a weighted credit and simulates a professional working environment. Students in this class will be offered accelerated experiences in radio broadcasting. Students may serve as advanced staff members, choosing to function within one department the entire year. They will develop special programming/projects within their department including, but not limited to; talk-based shows featuring CCS leaders, CCS and Carmel community events, imaging/branding for WHJE, community affairs programs, and live CCS sporting events. In addition, Radio WHJE 7-8 (fourth year) students can apply for director positions within the WHJE program. These positions include, but are not limited to; operations, program, news, promotions, public service, sports, and broadcast technician. Directors will organize staff personnel, monitor the production of content, and ensure the proper operation of all audio equipment and systems. Students enrolled in Radio WHJE 5-6 / 7-8 are the operating staff at 91.3 FM WHJE Carmel. After school hours are required. Television ",
      "id": 0,
      "semesters": 4,
      "classification": "Regular"
    },
    {
      "credits": 2,
      "name": "STUDENT MEDIA: BEGINNING TELEVISION : 1 - 2 (1086)",
      "weight": "regular",
      "description": "Note Core 40, Core 40 with Academic Honors and Core 40 with Technical Honors diplomas. This is a prerequisite course for the CHTV program. Students will have the opportunity to learn basic TV production skills. Topics such as cameras, audio, lighting, graphics, recording, and editing operations are covered. Students will learn the fundamentals of remote sports and event coverage. Instruction includes operation of studio cameras, video switcher, audio board, character generator, and teleprompter. Projects include news, packages, features, music videos, and studio produced talk shows. After school recording sessions will be required of students enrolled in the class. This class meets the state’s criteria for fulfilling the required technology graduation requirement. ",
      "id": 0,
      "semesters": 2,
      "classification": "Regular"
    },
    {
      "credits": 2,
      "name": "STUDENT MEDIA: INTERMEDIATE TELEVISION : CHTV : 3 - 4 (1086)",
      "weight": "regular",
      "description": "consent Note Core 40, Core 40 with Academic Honors and Core 40 with Technical Honors diplomas. Fulfills the Fine Arts requirement for the Core 40 with Academic Honors. This class goes into depth on producing TV news using our stateof-the-art TV studio and video editing lab. Students can explore both on-air talent and behind-the-scenes opportunities. Topics include script writing, interviewing, shooting video, editing, talent performance, and ethics. A major responsibility will be to produce the CHS morning announcements. This broadcast is also seen on our cable TV outlet. Sports, weather, and documentary production are covered as well in the class. After school hours will be required at times. This class meets the state’s criteria for fulfilling the required technology graduation requirement. STUDENT MEDIA ",
      "id": 0,
      "semesters": 2,
      "classification": "Regular"
    }
  ]
}
